{"config": [{"config": {"input_dim": 59, "trainable": true, "output_dim": 128, "U_regularizer": null, "init": "glorot_uniform", "forget_bias_init": "one", "return_sequences": true, "consume_less": "cpu", "stateful": false, "inner_activation": "hard_sigmoid", "input_dtype": "float32", "inner_init": "orthogonal", "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "dropout_U": 0.0, "unroll": false, "dropout_W": 0.0, "name": "lstm_1", "batch_input_shape": [null, 4, 59], "go_backwards": false, "input_length": 4}, "class_name": "LSTM"}, {"config": {"input_dim": 128, "trainable": true, "output_dim": 128, "U_regularizer": null, "init": "glorot_uniform", "forget_bias_init": "one", "return_sequences": true, "consume_less": "cpu", "stateful": false, "inner_activation": "hard_sigmoid", "input_dtype": "float32", "inner_init": "orthogonal", "W_regularizer": null, "activation": "tanh", "b_regularizer": null, "dropout_U": 0.0, "unroll": false, "dropout_W": 0.0, "name": "lstm_2", "batch_input_shape": [null, 4, 128], "go_backwards": false, "input_length": 4}, "class_name": "LSTM"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 64, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "bias": true, "trainable": true, "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "activation": "sigmoid", "b_constraint": null, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}