{"config": [{"config": {"input_dim": 59, "output_dim": 128, "W_constraint": null, "trainable": true, "activation": "relu", "bias": true, "name": "dense_1", "init": "uniform", "batch_input_shape": [null, 59], "W_regularizer": null, "b_constraint": null, "input_dtype": "float32", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "output_dim": 128, "W_constraint": null, "trainable": true, "activation": "relu", "bias": true, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "output_dim": 1, "W_constraint": null, "trainable": true, "activation": "sigmoid", "bias": true, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}